In [1]:
import pandas as pd
import numpy as np

In [2]:
pop2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8],
                    index=['Java','C','C++','Python','C#','PHP','JavaScript','Ruby','R','Matlab'])

In [3]:
pop2015 = pd.Series({'Java': 100,'C': 99.9,'C++': 99.4,'Python': 96.5,'C#': 91.3,
                     'R': 84.8,'PHP': 84.5,'JavaScript': 83.0,'Ruby': 76.2,'Matlab': 72.4})

In [8]:
twoyears = pd.DataFrame({'2014': pop2014, '2015':pop2015})

In [9]:
twoyears

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [13]:
twoyears = twoyears.sort_values('2015',ascending=False)

In [14]:
twoyears

             2014   2015
Java        100.0  100.0
C            99.3   99.9
C++          95.5   99.4
Python       93.5   96.5
C#           92.4   91.3
R            74.3   84.8
PHP          84.8   84.5
JavaScript   84.5   83.0
Ruby         78.9   76.2
Matlab       72.8   72.4

In [15]:
twoyears.values

array([[100. , 100. ],
       [ 99.3,  99.9],
       [ 95.5,  99.4],
       [ 93.5,  96.5],
       [ 92.4,  91.3],
       [ 74.3,  84.8],
       [ 84.8,  84.5],
       [ 84.5,  83. ],
       [ 78.9,  76.2],
       [ 72.8,  72.4]])

In [16]:
twoyears.index

Index(['Java', 'C', 'C++', 'Python', 'C#', 'R', 'PHP', 'JavaScript', 'Ruby',
       'Matlab'],
      dtype='object')

In [17]:
twoyears.columns

Index(['2014', '2015'], dtype='object')

In [18]:
twoyears['2014']

Java          100.0
C              99.3
C++            95.5
Python         93.5
C#             92.4
R              74.3
PHP            84.8
JavaScript     84.5
Ruby           78.9
Matlab         72.8
Name: 2014, dtype: float64

In [23]:
twoyears.loc['C':'Python']

        2014  2015
C       99.3  99.9
C++     95.5  99.4
Python  93.5  96.5

In [24]:
twoyears.iloc[0:2]

       2014   2015
Java  100.0  100.0
C      99.3   99.9

In [25]:
twoyears['avg'] = 0.5*(twoyears['2014'] + twoyears['2015'])

In [26]:
twoyears

             2014   2015     avg
Java        100.0  100.0  100.00
C            99.3   99.9   99.60
C++          95.5   99.4   97.45
Python       93.5   96.5   95.00
C#           92.4   91.3   91.85
R            74.3   84.8   79.55
PHP          84.8   84.5   84.65
JavaScript   84.5   83.0   83.75
Ruby         78.9   76.2   77.55
Matlab       72.8   72.4   72.60

In [27]:
presidents = pd.DataFrame([{'name': 'Barack Obama','inauguration': 2009,'birthyear': 1961},
                          {'name': 'George W. Bush','inauguration': 2001,'birthyear': 1946},
                          {'name': 'Bill Clinton','birthyear': 1946,'inauguration': 1993},
                          {'name': 'George H. W. Bush','inauguration': 1989,'birthyear': 1924}])

In [28]:
presidents

                name  inauguration  birthyear
0       Barack Obama          2009       1961
1     George W. Bush          2001       1946
2       Bill Clinton          1993       1946
3  George H. W. Bush          1989       1924

In [29]:
president_indexes = presidents.set_index('name')

In [34]:
president_indexes

                   inauguration  birthyear
name
Barack Obama               2009       1961
George W. Bush             2001       1946
Bill Clinton               1993       1946
George H. W. Bush          1989       1924

In [37]:
president_indexes.loc['Barack Obama']

pandas.core.series.Series

In [36]:
president_indexes.loc['Barack Obama']['inauguration']

2009

In [41]:
president_indexes['inauguration']['Barack Obama']

2009

In [42]:
presidents_fathers = pd.DataFrame([{'son': 'Barack Obama','father': 'Barack Obama, Sr.'},
                                   {'son': 'George W. Bush','father': 'George H. W. Bush'},
                                   {'son': 'George H. W. Bush','father': 'Prescott Bush'}])

In [45]:
pd.merge(presidents, presidents_fathers, left_on="name", right_on="son")

,name,inauguration,birthyear,son,father
0,Barack Obama,2009,1961,Barack Obama,"Barack Obama, Sr."
1,George W. Bush,2001,1946,George W. Bush,George H. W. Bush
2,George H. W. Bush,1989,1924,George H. W. Bush,Prescott Bush

In [46]:
pd.merge(presidents, presidents_fathers, left_on="name", right_on="son").drop('son', axis=1)

                name  inauguration  birthyear             father
0       Barack Obama          2009       1961  Barack Obama, Sr.
1     George W. Bush          2001       1946  George H. W. Bush
2  George H. W. Bush          1989       1924      Prescott Bush

In [47]:
pd.merge(presidents, presidents_fathers, left_on="name", right_on="son", how="left").drop('son', axis=1)

                name  inauguration  birthyear             father
0       Barack Obama          2009       1961  Barack Obama, Sr.
1     George W. Bush          2001       1946  George H. W. Bush
2       Bill Clinton          1993       1946                NaN
3  George H. W. Bush          1989       1924      Prescott Bush

In [48]:
pd.DataFrame(np.random.choice(['a','b','c','d'],(3,3)),index=[1,2,3],columns=['A','B','C'])

   A  B  C
1  c  c  b
2  c  a  c
3  c  b  d